; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	spectrograph1 - mode
	infrared0 - mode
	thermograph2 - mode
	Star1 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	Star5 - direction
	GroundStation6 - direction
	GroundStation8 - direction
	Star0 - direction
	Star7 - direction
	GroundStation4 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Star15 - direction
	Star16 - direction
	Star17 - direction
	Planet18 - direction
	Phenomenon19 - direction
)
(:init
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation4)
	(calibration_target instrument0 Star0)
	(calibration_target instrument0 GroundStation8)
	(supports instrument1 spectrograph1)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star7)
	(supports instrument2 spectrograph1)
	(supports instrument2 infrared0)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star15)
)
(:goal (and
	(pointing satellite0 GroundStation3)
	(have_image Planet9 thermograph2)
	(have_image Phenomenon10 thermograph2)
	(have_image Phenomenon11 spectrograph1)
	(have_image Planet12 spectrograph1)
	(have_image Phenomenon13 thermograph2)
	(have_image Planet14 infrared0)
	(have_image Star15 thermograph2)
	(have_image Star16 infrared0)
	(have_image Star17 spectrograph1)
	(have_image Planet18 thermograph2)
	(have_image Phenomenon19 spectrograph1)
))

)

; plan
1. (turn_to satellite0 groundstation4 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 groundstation4)
   goals met: 0 of 12
2. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 12
3. (calibrate satellite0 instrument2 groundstation4)
   added: (calibrated instrument2)
   goals met: 0 of 12
4. (turn_to satellite0 star16 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 star16)
   goals met: 0 of 12
5. (take_image satellite0 star16 instrument2 infrared0)
   added: (have_image star16 infrared0)
   goals met: 1 of 12
6. (turn_to satellite0 planet14 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 planet14)
   goals met: 1 of 12
7. (take_image satellite0 planet14 instrument2 infrared0)
   added: (have_image planet14 infrared0)
   goals met: 2 of 12
8. (turn_to satellite0 phenomenon11 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 phenomenon11)
   goals met: 2 of 12
9. (take_image satellite0 phenomenon11 instrument2 spectrograph1)
   added: (have_image phenomenon11 spectrograph1)
   goals met: 3 of 12
10. (turn_to satellite0 star7 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 star7)
   goals met: 3 of 12
11. (switch_off instrument2 satellite0)
   deleted: (power_on instrument2)
   added: (power_avail satellite0)
   goals met: 3 of 12
12. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 3 of 12
13. (calibrate satellite0 instrument1 star7)
   added: (calibrated instrument1)
   goals met: 3 of 12
14. (turn_to satellite0 phenomenon10 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 phenomenon10)
   goals met: 3 of 12
15. (take_image satellite0 phenomenon10 instrument1 thermograph2)
   added: (have_image phenomenon10 thermograph2)
   goals met: 4 of 12
16. (turn_to satellite0 phenomenon13 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon13)
   goals met: 4 of 12
17. (take_image satellite0 phenomenon13 instrument1 thermograph2)
   added: (have_image phenomenon13 thermograph2)
   goals met: 5 of 12
18. (turn_to satellite0 phenomenon19 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon19)
   goals met: 5 of 12
19. (take_image satellite0 phenomenon19 instrument1 spectrograph1)
   added: (have_image phenomenon19 spectrograph1)
   goals met: 6 of 12
20. (turn_to satellite0 planet12 phenomenon19)
   deleted: (pointing satellite0 phenomenon19)
   added: (pointing satellite0 planet12)
   goals met: 6 of 12
21. (take_image satellite0 planet12 instrument1 spectrograph1)
   added: (have_image planet12 spectrograph1)
   goals met: 7 of 12
22. (turn_to satellite0 planet18 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet18)
   goals met: 7 of 12
23. (take_image satellite0 planet18 instrument1 thermograph2)
   added: (have_image planet18 thermograph2)
   goals met: 8 of 12
24. (turn_to satellite0 planet9 planet18)
   deleted: (pointing satellite0 planet18)
   added: (pointing satellite0 planet9)
   goals met: 8 of 12
25. (take_image satellite0 planet9 instrument1 thermograph2)
   added: (have_image planet9 thermograph2)
   goals met: 9 of 12
26. (turn_to satellite0 star15 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star15)
   goals met: 9 of 12
27. (take_image satellite0 star15 instrument1 thermograph2)
   added: (have_image star15 thermograph2)
   goals met: 10 of 12
28. (turn_to satellite0 star17 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star17)
   goals met: 10 of 12
29. (take_image satellite0 star17 instrument1 spectrograph1)
   added: (have_image star17 spectrograph1)
   goals met: 11 of 12
30. (turn_to satellite0 groundstation3 star17)
   deleted: (pointing satellite0 star17)
   added: (pointing satellite0 groundstation3)
   goals met: 12 of 12
